[
  {
    "id" : "iOSDevUK 12",
    "about" : "iOSDevUK is a conference organised by the Computer Science Department at Aberystwyth University. iOS, iPhone, iPad, Apple Watch, watchOS, Vision Pro, visionOS, Apple TV and tvOS are trademarks of Apple Inc. For the avoidance of doubt, Apple Inc. has no association with this conference.",
    "startDate" : "2024-09-02T16:00:00+0100",
    "endDate" : "2024-09-05T17:00:00+0100",
    "inclusivityText" : "We believe that anyone should be able to feel welcome, included, and safe at our conference. That means anyone, irrespective of gender, gender identity and expression, sexual orientation, disability, physical appearance, body size, race, religion.\n\nFirst, we'll do everything we can to accommodate people’s needs. All we ask is that, if you know you’re going to need something, you tell us about it before the event (the sooner the better!).\n\nSecond, we won't tolerate staff, speakers, attendees, or sponsors engaging in behaviour that excludes people, whether that's harassment, bullying, overt or covert racism or sexism. (Not tolerating means we’ll eject people, if we have to.)\n\nHarassment includes offensive verbal comments related to gender, gender identity and expression, sexual orientation, disability, physical appearance, body size, race, religion, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.\n\nAnyone asked to stop harassing behaviour is expected to do so, immediately.\n\nIf you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact one of the iOSDevUK team immediately.\n\niOSDevUK staff will be happy to help participants contact university security or local law enforcement, provide escorts, or otherwise assist those experiencing harassment to feel safe for the duration of the conference. We value your attendance.\n\nThe policy applies at all conference and workshop venues and conference-related social events.",
    "notification" : "iOSDevUK 12 takes place at Aberystwyth University from 2nd to 5th September 2024"
  }
]
