[
  {
    "content" : "We've come a long way since watchOS 1, yet we hardly talk about it.  I will show you why watchOS is the perfect platform to experiment with and learn new skills on. During this session, we will dip our toes into some details and know-how of a modern-day watch app, and you'll be left excited about this platform.",
    "endDate" : "2023-09-04T18:00:00+0100",
    "id" : "d1_s1_1_1",
    "startDate" : "2023-09-04T16:00:00+0100",
    "title" : "It's time to build for watchOS",
    "type" : "workshop",
    "speakerIds" : [
      "HiddevanderPloeg"
    ]
  },
  {
    "content" : "Are you interested in building beautiful and intuitive macOS applications with SwiftUI? In this workshop, we'll explore the current state of macOS development with SwiftUI and discuss the benefits and challenges of using this framework. We'll cover a range of topics, including SwiftUI layout and design, integration with existing macOS technologies, and strategies for building scalable and maintainable apps. We'll also delve into advanced topics such as custom view modifiers and integrating with AppKit. Whether you're new to macOS development or a seasoned pro, this workshop will provide valuable insights and techniques for building modern, high-quality apps with SwiftUI. Join us to learn more about the state of macOS development with SwiftUI.",
    "endDate" : "2023-09-04T18:00:00+0100",
    "id" : "d1_s1_1_2",
    "startDate" : "2023-09-04T16:00:00+0100",
    "title" : "Making polished macOS apps with SwiftUI",
    "type" : "workshop",
    "speakerIds" : [
      "IbrahimaCiss"
    ]
  },
  {
    "content" : "There aren't any official activities on the Monday evening. There is an optional gathering at the Wetherspoons pub in the centre of town, at the front of the railway session. Come along at any point in the evening and see who else is there.",
    "endDate" : "2023-09-04T23:00:00+0100",
    "id" : "d1_s1_2_1",
    "startDate" : "2023-09-04T18:00:00+0100",
    "title" : "No official activities - optional social at Yr Hen Orsaf\n(Wetherspoons pub that is part of Aberystwyth Railway Station)",
    "type" : "social",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "Registration will take place outside the Great Hall in the Arts Centre. Come along and collect your badge. If you were at the workshops on Monday afternoon, you will already have your badge.",
    "endDate" : "2023-09-05T09:30:00+0100",
    "id" : "d2_s1_1_1",
    "startDate" : "2023-09-05T09:00:00+0100",
    "title" : "Registration",
    "type" : "registration",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "Welcome to iOSDEVUK 11! \nJust a brief appearance by Neil and Chris to say hello to all the delegates, and to set the scene for what is to come. ",
    "endDate" : "2023-09-05T09:40:00+0100",
    "id" : "d2_s1_2_1",
    "startDate" : "2023-09-05T09:30:00+0100",
    "title" : "Welcome\/Introduction",
    "type" : "talk",
    "speakerIds" : [
      "ChrisPrice",
      "NeilTaylor"
    ]
  },
  {
    "content" : "At Bumble we are always looking for opportunities to optimise the time we spend developing our features without losing quality.   \nWhen Apple announced SwiftUI a few years back I realised that this new tech stack could bring many benefits to our developers and I thought that we should give it a try. I just didn't think about an important caveat, our team consists of almost 50 iOS developers.  \nWhen it comes to introducing SwiftUI for such a large team, there are questions that cannot be resolved easily:  How do you manage issues and bugs contained in early versions of SwiftUI? Is SwiftUI navigation mature enough in early versions? Where do you start using SwiftUI in an existing large codebase?  How to train your developers to use this new tech stack? and many other questions like this…  \nI would love to tell you how we manage to introduce SwiftUI as part of our development process and we made this process as seamless as possible for our team of developers.",
    "endDate" : "2023-09-05T10:20:00+0100",
    "id" : "d2_s1_3_1",
    "startDate" : "2023-09-05T09:40:00+0100",
    "title" : "Adopting SwiftUI at scale",
    "type" : "talk",
    "speakerIds" : [
      "AlexisSantos"
    ]
  },
  {
    "content" : "I have been using Swift to write all tooling that I build on a daily basis, both for work and for personal projects. I have made all sorts of things using just Swift and I have written about them on my blog: git hooks, micro-services that process data, cron jobs which update my Github profile with dynamic data, and even an AWS lambda that posts a tweet out every time a newsletter issue is sent tagging all featured authors.\nThis time I want to embark on a journey to build a metrics system that measures, analyses, and displays the duration of a repository's CI\/CD workflows over time using only Swift.\nThe system will have 4 parts:\n1. A command line tool that is written entirely in Swift and uses modern concurrency to interact with the CI provider's API and collect data.\n2. A CI workflow that runs every night and collects the data for a given day using the command line tool we've created.\n3. A serverless function (I'll show two options where this can be deployed) using Swift and modern concurrency to process the data and persist it. This serverless function will also trigger an alarm and send a message on Slack if any of the builds exceed a threshold duration.\n4. A website that acts as a dashboard to display all the data collected. Again, this will be built exclusively with Swift - We won't write any HTML files directly.\nThe aim of the talk is to give you an insight at why Swift is a great option for writing complex developer tooling which go way beyond scripts and command line tools.",
    "endDate" : "2023-09-05T11:00:00+0100",
    "id" : "d2_s1_4_1",
    "startDate" : "2023-09-05T10:20:00+0100",
    "title" : "Making developer tools with Swift",
    "type" : "talk",
    "speakerIds" : [
      "PolPiellaAbadia"
    ]
  },
  {
    "content" : "Coffee and tea will be available with cakes. Come to the Theatre Foyer to recharge.",
    "endDate" : "2023-09-05T11:30:00+0100",
    "id" : "d2_s1_5_1",
    "startDate" : "2023-09-05T11:00:00+0100",
    "title" : "Coffee Break",
    "type" : "coffeeBiscuits",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "An overview of how to use the GroupActivities API to implement SharePlay in your app.\nIn particular, I will talk through some of the code in the app I built which uses this API to allow the user to play a card game with their friends while on a FaceTime call:\nhttps:\/\/twitter.com\/Oliver_Binns\/status\/1486082440670162945\nI will outline the two types of communication available within the API (GroupSession.State and GroupSessionMessenger) and explain the situations where each are the most useful.\nI also will touch on some of the challenges I had to overcome include ensuring enough users have joined for the game to be played and allowing for users to drop off and rejoin the call.\nhttps:\/\/github.com\/Oliver-Binns\/cards",
    "endDate" : "2023-09-05T12:10:00+0100",
    "id" : "d2_s1_6_1",
    "startDate" : "2023-09-05T11:30:00+0100",
    "title" : "Turn based games using SharePlay",
    "type" : "talk",
    "speakerIds" : [
      "OliverBinns"
    ]
  },
  {
    "content" : "In this talk, we will explore how to use SwiftUI to create a design system for our apps. We'll focus on using standard types and patterns provided by SwiftUI. I will demonstrate:\n* How to make reusable styles for common UI elements\n* Techniques for building new components utilising generic parameters\n* How to customise these components by using EmptyView",
    "endDate" : "2023-09-05T12:10:00+0100",
    "id" : "d2_s1_6_2",
    "startDate" : "2023-09-05T11:30:00+0100",
    "title" : "Creating a Design System with SwiftUI",
    "type" : "talk",
    "speakerIds" : [
      "DanielTull"
    ]
  },
  {
    "content" : "Learn how to navigate the iOS open source landscape and make a real impact as a developer. This talk will cover the ins and outs of getting involved, from finding the right projects to contributing effectively. You'll also learn tips and strategies for success, as well as how to build a community and make meaningful connections within the open source community.",
    "endDate" : "2023-09-05T12:50:00+0100",
    "id" : "d2_s1_7_1",
    "startDate" : "2023-09-05T12:10:00+0100",
    "title" : "From Consumer to Creator: A Guide to iOS Open Source Contributions",
    "type" : "talk",
    "speakerIds" : [
      "MaxCobb"
    ]
  },
  {
    "content" : "I aim to talk about the technical bits around subscriptions to help developers understand how to best make use of subscriptions and the problems they may run into. Here are the points I will talk about in the speech:\n - Types of subscriptions\n - subscription groups\n - doing price rises for subscriptions and the caveats\n - grace periods\n - retaining subscribers and preventing churn\n - Server notifications",
    "endDate" : "2023-09-05T12:50:00+0100",
    "id" : "d2_s1_7_2",
    "startDate" : "2023-09-05T12:10:00+0100",
    "title" : "Making the most of Subscriptions",
    "type" : "talk",
    "speakerIds" : [
      "AnumMian"
    ]
  },
  {
    "content" : "Sandwiches, crisps, brownies and flapjacks in the Theatre Foyer. There is a meet-up for women at iOSDevUK during this lunch break.",
    "endDate" : "2023-09-05T14:00:00+0100",
    "id" : "d2_s1_8_1",
    "startDate" : "2023-09-05T12:50:00+0100",
    "title" : "Lunch, including Women at iOSDevUK get together.",
    "type" : "lunch",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "This talk will provide an in-depth look into how Skyscanner has modernised its login and sign-up flows to remove the need for our travellers to ever enter a password. It will explain how Skyscanner has used One Time Passcodes to deliver a more secure and more effective login solution. The audience will learn how we transformed our identity system from a known target for hackers, to an award winning identity platform, improving the security of the system and dramatically increasing the success rate of both our login and sign-up flows. \nIt is increasingly common to read about the latest credentials ‘leak' of password based login credentials online. What can also accompany these breaches are hefty fines for the companies involved, something everyone is keen to avoid. This talk will give a practical overview to empower engineers or software architects with a solution for how a password-less identity solution can be designed. It will also offer useful advice on how to build this solution for scale, resilience and flexibility.",
    "endDate" : "2023-09-05T14:40:00+0100",
    "id" : "d2_s2_1_1",
    "startDate" : "2023-09-05T14:00:00+0100",
    "title" : "Password-less Login and Sign-up at Skyscanner",
    "type" : "talk",
    "speakerIds" : [
      "MichaelBaldock"
    ]
  },
  {
    "content" : "As a developer moving into a leadership role for the first time it can be can be tough, confusing, and at times overwhelming. This was certainly the case for me. I discovered that the principles I had once followed when building software were no longer effective as a leader. However, after a few years I can confidently say that becoming a leader is one of the most fulfilling things I've done. In this talk you will learn some of the ways to adapt your developer skillset to that of a tech lead, and I will share my observations in making these adjustments myself. We'll look at how the problems you need to solve are suddenly very unfamiliar, with intensives that are often the reverse to what you've been used to. If you've had similar experiences or are considering a move into leadership yourself, this talk is for you. You will leave with an number of effective strategies for becoming a tech lead, while remaining kind to yourself and others.",
    "endDate" : "2023-09-05T14:40:00+0100",
    "id" : "d2_s2_1_2",
    "startDate" : "2023-09-05T14:00:00+0100",
    "title" : "Do Repeat Yourself. How to move from Development into Leadership.",
    "type" : "talk",
    "speakerIds" : [
      "LukeStringer"
    ]
  },
  {
    "content" : "Server-side Swift can get pushed aside for more mature platforms like Ruby on Rails simply because it's, well, less mature. However, for a small company or solo developer, it promises nirvana: use the expertise I already have in Swift to deploy a backend — even running the exact same code that powers the app locally? Heck yeah, sounds great! This talk tells the story of writing and deploying a backend for a new app entirely using Swift on the Server with Vapor on the Heroku platform. Does reality live up to the promises? ",
    "endDate" : "2023-09-05T15:20:00+0100",
    "id" : "d2_s2_2_1",
    "startDate" : "2023-09-05T14:40:00+0100",
    "title" : "Server-Side Swift for Small Startup Success",
    "type" : "talk",
    "speakerIds" : [
      "DanielKennett"
    ]
  },
  {
    "content" : "Building iOS apps that can function effectively when offline or in low-connectivity environments allows apps to provide a seamless experience to users even when they are not connected to the internet. There are several techniques that can be used to build iOS apps that can function effectively when offline, including the following:\n- Storing and synchronizing data\n- Handling network errors\n- Optimizing performance",
    "endDate" : "2023-09-05T15:20:00+0100",
    "id" : "d2_s2_2_2",
    "startDate" : "2023-09-05T14:40:00+0100",
    "title" : "iOS app development for offline use",
    "type" : "talk",
    "speakerIds" : [
      "AviTsadok"
    ]
  },
  {
    "content" : "How Spotify broke apart a feature with 90k lines of ObjC. We'll cover how we modularised the monolith, decomposed the existing logic into manageable chunks, and built it back up using Swift.",
    "endDate" : "2023-09-05T16:00:00+0100",
    "id" : "d2_s2_3_1",
    "startDate" : "2023-09-05T15:20:00+0100",
    "title" : "Modularising a monolith!",
    "type" : "talk",
    "speakerIds" : [
      "AraksAvoyan"
    ]
  },
  {
    "content" : "In this talk, we will explore the various accessibility features available in iOS and how they can be used to improve the user experience for individuals with disabilities. We will cover topics such as VoiceOver, which allows users to interact with their device using voice commands, and the ability to customize the display for users with visual impairments. We will also discuss the importance of considering accessibility in the design and development process and how to test for accessibility in iOS apps.",
    "endDate" : "2023-09-05T16:00:00+0100",
    "id" : "d2_s2_3_2",
    "startDate" : "2023-09-05T15:20:00+0100",
    "title" : "Enhancing the User Experience through Accessibility in iOS",
    "type" : "talk",
    "speakerIds" : [
      "RizwanAhmedA"
    ]
  },
  {
    "content" : "Coffee, tea and biscuits in the Theatre Foyer.",
    "endDate" : "2023-09-05T16:30:00+0100",
    "id" : "d2_s2_4_1",
    "startDate" : "2023-09-05T16:00:00+0100",
    "title" : "Coffee Break",
    "type" : "coffeeBiscuits",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "As most people tend to use cloud sync services to store relevant content, we will explore File Provider framework on both iOS and macOS and all the related features: Finder and Files app integration, remote synchronisation with upload and downloads.\nSo let's take a ride, just drive!",
    "endDate" : "2023-09-05T17:10:00+0100",
    "id" : "d2_s2_5_1",
    "startDate" : "2023-09-05T16:30:00+0100",
    "title" : "Drive Thru File Provider",
    "type" : "talk",
    "speakerIds" : [
      "AudreySobgouZebaze"
    ]
  },
  {
    "content" : "In our fast paced world, there is just too much information, and it often seems impossible to keep up with everything that's going on.\nIf you ever felt that you couldn't possibly remember everything you saw, read, or even didn't read, come to this talk and I will show you how I build an app that allows me to do just that.\nI will show you how I\n- used SwiftUI to build a beautiful app that works across Apple's platforms (including VisionPro)\n- used Cloud Firestore to store gigabytes of data, keeping it in sync across all of my devices\n- used the PaLM API to summarise articles, and ask my app questions about articles\n- used LangChain to connect PaLM to my personal data store\n- Use Siri to provide a natural language interface that allows me to query my knowledge base hands-free",
    "endDate" : "2023-09-05T17:50:00+0100",
    "id" : "d2_s2_6_1",
    "startDate" : "2023-09-05T17:10:00+0100",
    "title" : "How I used Siri, PaLM, LangChain, and Firebase to create an Exobrain",
    "type" : "talk",
    "speakerIds" : [
      "PeterFriese"
    ]
  },
  {
    "content" : "Come and join in the conference dinner in Medrus Mawr, near to the main entrance to campus. The meal is included as part of your conference fee. A great place to meet other attendees.\nThe drinks at the conference dinner are sponsored by Marathon Labs.",
    "endDate" : "2023-09-05T22:00:00+0100",
    "id" : "d2_s3_1_1",
    "startDate" : "2023-09-05T18:45:00+0100",
    "title" : "Conference Dinner at Medrus Mawr ",
    "type" : "dinner",
    "speakerIds" : [

    ]
  },
  {
    "content" : "A series of 5 minute talks on topical subjects from conference attendees. Details to be announced.",
    "endDate" : "2023-09-06T10:10:00+0100",
    "id" : "d3_s1_1_1",
    "startDate" : "2023-09-06T09:30:00+0100",
    "title" : "Lightning talks",
    "type" : "talk",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "This talk will focus on real-world scenarios of implementing push notifications for large scale iOS applications. We'll review the fundamentals and dive straight into more advanced use cases, like server-side notifications and challenges that come with them, considerations around user preferences and what to keep in mind when testing push notifications. This talk is not about presenting an ultimate guide to iOS push notifications. Rather, it's about sharing a journey - the pitfalls, triumphs, and lessons learned along the way.",
    "endDate" : "2023-09-06T10:50:00+0100",
    "id" : "d3_s1_2_1",
    "startDate" : "2023-09-06T10:10:00+0100",
    "title" : "Get the message? Lessons learned from iOS push notifications in the wild",
    "type" : "talk",
    "speakerIds" : [
      "NataliaPanferova"
    ]
  },
  {
    "content" : "Coffee and tea will be available with cakes. Come to the Theatre Foyer to recharge.",
    "endDate" : "2023-09-06T11:30:00+0100",
    "id" : "d3_s1_3_1",
    "startDate" : "2023-09-06T10:50:00+0100",
    "title" : "Coffee Break",
    "type" : "coffeeBiscuits",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "Last year at WWDC22, Apple introduced Swift Charts. An easy way to make beautiful charts in SwiftUI. In their sample, Apple uses (for simplicity) datasets they created. When using CoreData, there is a good chance that the datasets aren't static and ready to be used in a statistic.\nThis talk shows how to use NSExpressions to process data before fetching it from CoreData. This includes ideas on structuring data as well as solutions for problems that may arise. With this, the data in CoreData can be fetched in a way to use it directly in Swift Charts.",
    "endDate" : "2023-09-06T12:10:00+0100",
    "id" : "d3_s1_4_1",
    "startDate" : "2023-09-06T11:30:00+0100",
    "title" : "Take The NSExpress: From CoreData non stop into Swift Charts",
    "type" : "talk",
    "speakerIds" : [
      "LenaMatteaStöxen"
    ]
  },
  {
    "content" : "We'll be looking at ways you can connect to hardware from your iOS app. MFi is out of reach for most of us, so what are the alternatives. We'll have a look at Bluetooth, WiFi and maybe some more esoteric ways that you can connect to control bits of hardware from your iOS apps.",
    "endDate" : "2023-09-06T12:10:00+0100",
    "id" : "d3_s1_4_2",
    "startDate" : "2023-09-06T11:30:00+0100",
    "title" : "How do we talk to hardware? Interfacing with your IoT gadget",
    "type" : "talk",
    "speakerIds" : [
      "ChrisGreening"
    ]
  },
  {
    "content" : "Need a description",
    "endDate" : "2023-09-06T12:50:00+0100",
    "id" : "d3_s1_5_1",
    "startDate" : "2023-09-06T12:10:00+0100",
    "title" : "Polishing your monetisation",
    "type" : "talk",
    "speakerIds" : [
      "AlexKudelka"
    ]
  },
  {
    "content" : "With the buzz around IoT devices, Bluetooth Low Energy technology has become increasingly popular. Apple's CoreBluetooth has been around since iOS 5, and offers a host of utility APIs. In this talk, I will cover the basics of Bluetooth LE technology and its terminology. You will learn about services and characteristics, and then dive into the CoreBluetooth APIs and become familiar with the CBManager, CBPeripheral and their respective delegates. I will also discuss the challenges in making the code testable, and offer some practical tips that are easily overlooked from the documentation. \nAttendees will come away with a better understanding of Bluetooth LE and the tools to build iOS apps using this powerful framework.",
    "endDate" : "2023-09-06T12:50:00+0100",
    "id" : "d3_s1_5_2",
    "startDate" : "2023-09-06T12:10:00+0100",
    "title" : "Who's Afraid of the Big Bad Bluetooth?",
    "type" : "talk",
    "speakerIds" : [
      "LeahVogel"
    ]
  },
  {
    "content" : "Sandwiches, crisps, brownies and flapjacks in the Theatre Foyer.",
    "endDate" : "2023-09-06T14:00:00+0100",
    "id" : "d3_s1_6_1",
    "startDate" : "2023-09-06T12:50:00+0100",
    "title" : "Lunch",
    "type" : "lunch",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "In this hands-on experience, Allison will walk the audience through how to build iOS apps that allow users to manipulate and enhance images with Stable Diffusion and CoreML. Developers will leave with a better understanding of how these Apple libraries work together and how to allow users to choose configurations and settings, as well as how to train and incorporate new ML models for optimal experiences.",
    "endDate" : "2023-09-06T14:40:00+0100",
    "id" : "d3_s2_1_1",
    "startDate" : "2023-09-06T14:00:00+0100",
    "title" : "Stable Diffusion, CoreML and the future of AI for iOS",
    "type" : "talk",
    "speakerIds" : [
      "AllisonMcEntire"
    ]
  },
  {
    "content" : "UI testing is often regarded as a demanding aspect of iOS app development, with building a robust and efficient infrastructure for running UI tests being one of the most challenging tasks. In this talk, we will explore the key requirements for constructing a successful UI test infrastructure, evaluate existing solutions and how they address these requirements, and discuss the costs associated with building your own infrastructure.",
    "endDate" : "2023-09-06T15:20:00+0100",
    "id" : "d3_s2_2_1",
    "startDate" : "2023-09-06T14:40:00+0100",
    "title" : "Crafting a Scalable UI Test Infrastructure for iOS Applications",
    "type" : "talk",
    "speakerIds" : [
      "EvgeniiMatsiuk"
    ]
  },
  {
    "content" : "",
    "endDate" : "2023-09-06T16:00:00+0100",
    "id" : "d3_s2_3_1",
    "startDate" : "2023-09-06T15:20:00+0100",
    "title" : "unknown 1",
    "type" : "talk",
    "speakerIds" : [
      "unknown1"
    ]
  },
  {
    "content" : "Coffee, tea and biscuits in the Theatre Foyer. During the break, we will take the Conference Photo. Arrangements for the photo will be announced just before the coffee break.",
    "endDate" : "2023-09-06T16:30:00+0100",
    "id" : "d3_s2_4_1",
    "startDate" : "2023-09-06T16:00:00+0100",
    "title" : "Coffee Break and Conference Photo",
    "type" : "coffeeBiscuits",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "Your SwiftUI code is supposed to be a clear, semantic description of what should be on the screen, but it's easy to lose that clarity underneath a mess of appearance-related modifiers. Learn how SwiftUI's styles help you separate meaning and appearance again for built-in views, and how to make your own stylable views.",
    "endDate" : "2023-09-06T17:10:00+0100",
    "id" : "d3_s2_5_1",
    "startDate" : "2023-09-06T16:30:00+0100",
    "title" : "I've got style, miles and miles",
    "type" : "talk",
    "speakerIds" : [
      "RichTurton"
    ]
  },
  {
    "content" : "In this talk, I will be presenting an overview of The Composable Architecture, an architectural library for iOS applications created by PointFree. This library provides developers with a consistent and modular approach to building applications, with a focus on testing and developer experience.\nDuring the talk, I will explain the different parts of the library, including its Reducer, State, and Actions, as well as how it can be used to create well-structured, maintainable, and scalable apps. I will also demonstrate how TCA facilitates in the writing of tests and testable code. I would like the talk to give a kick start to people using TCA for the first time, helping them get up to speed with it quickly.",
    "endDate" : "2023-09-06T17:50:00+0100",
    "id" : "d3_s2_6_1",
    "startDate" : "2023-09-06T17:10:00+0100",
    "title" : "The Composable Architecture",
    "type" : "talk",
    "speakerIds" : [
      "OliverFoggin"
    ]
  },
  {
    "content" : "A series of 5 minute talks on topical subjects from conference attendees. Details to be announced.",
    "endDate" : "2023-09-07T10:00:00+0100",
    "id" : "d4_s1_1_1",
    "startDate" : "2023-09-07T09:30:00+0100",
    "title" : "Lightning Talks",
    "type" : "lightningTalk",
    "speakerIds" : [

    ]
  },
  {
    "content" : "What on earth is Bazel? Well, many people will tell you it's a build system. Ok, what is a build system? It's a system of tools to speed up your build process. What happens in the build process??\nDon't panic, it's all a lot simpler than people may thing.\nThis talk will cover the basics of build systems, of Bazel, and all the things that you never dared to ask. I will fill it with (attempts of) jokes and high energy to try and turn an intensive topic into a fun one!!\nDescription: \nI always loved creating apps and making things, and I still do. But as I worked on optimising my code and learning modern development techniques, I was always curious about what happens when you press that Build button in Xcode. What's going on behind the curtain? How does that turn your code into an app. I was fascinated by this, however, I never satisfied this curiosity until I jumped in the deep end, and started working as a mobile infrastructure engineer at Spotify.\nIn this talk I want to demystify the build process, explain build systems, and share my knowledge to help people form a solid foundation to build their infrastructure knowledge on.",
    "endDate" : "2023-09-07T10:40:00+0100",
    "id" : "d4_s1_2_1",
    "startDate" : "2023-09-07T10:00:00+0100",
    "title" : "Build-A-Binary",
    "type" : "talk",
    "speakerIds" : [
      "AnnaBeltrami"
    ]
  },
  {
    "content" : "Coffee and tea will be available with cakes. Come to the Theatre Foyer to recharge.",
    "endDate" : "2023-09-07T11:10:00+0100",
    "id" : "d4_s1_3_1",
    "startDate" : "2023-09-07T10:40:00+0100",
    "title" : "Coffee Break",
    "type" : "coffeeBiscuits",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "As Swift marches towards Swift 6, new features like memory checking and Sendable ensure that many issues that were once runtime errors are now caught by the compiler. In this talk we'll take a deep dive into Sendable, actors and other tools you can use to ensure your apps are safe. You'll learn what they are, how they work and how to use them in your code to write better apps.",
    "endDate" : "2023-09-07T11:40:00+0100",
    "id" : "d4_s1_4_1",
    "startDate" : "2023-09-07T11:10:00+0100",
    "title" : "Diving Deep into Sendable",
    "type" : "talk",
    "speakerIds" : [
      "TimCondon"
    ]
  },
  {
    "content" : "Have a peek at the internals of the scene graph and related tech that Sketch uses for rendering",
    "endDate" : "2023-09-07T12:20:00+0100",
    "id" : "d4_s1_5_1",
    "startDate" : "2023-09-07T11:40:00+0100",
    "title" : "Sketch: A peek behind the Scenes",
    "type" : "talk",
    "speakerIds" : [
      "MikeAbdullah"
    ]
  },
  {
    "content" : "FIXME",
    "endDate" : "2023-09-07T13:00:00+0100",
    "id" : "d4_s1_6_1",
    "startDate" : "2023-09-07T12:20:00+0100",
    "title" : "Lunch",
    "type" : "lunch",
    "speakerIds" : [
      "You"
    ]
  },
  {
    "content" : "Design and develop an AR app from scratch to a more interactive level ",
    "endDate" : "2023-09-07T15:00:00+0100",
    "id" : "d4_s2_1_1",
    "startDate" : "2023-09-07T13:00:00+0100",
    "title" : "How to design interactive AR in SwiftUI",
    "type" : "workshop",
    "speakerIds" : [
      "KosalaJayasekara"
    ]
  },
  {
    "content" : "SwiftUI makes it easy to create beautiful UIs in no time, but it is just as easy to end up with a giant view that mixes view code and business logic. Fortunately, Apple gave us some tools to keep the bloat in check and write maintainable and reusable code.\nIn this talk, I am going to show you how to\n* refactor an existing SwiftUI view to make it more maintainable,\n* turn it into a reusable SwiftUI component,\n* add event handling,\n* make the view configurable,\n* add it to the Xcode component library,\n* turn it into a shareable component that can be consumed via Swift Package Manager,\nand distribute it via GitHub and the Swift Package Index",
    "endDate" : "2023-09-07T15:00:00+0100",
    "id" : "d4_s2_1_2",
    "startDate" : "2023-09-07T13:00:00+0100",
    "title" : "Building Reusable SwiftUI Components",
    "type" : "workshop",
    "speakerIds" : [
      "PeterFriese"
    ]
  }
]
